org-roam.bak/20200929150510-unix.org
*** Symbolic Names and Numbers
:PROPERTIES:
:NOTER_PAGE: 6
:END:

Segnali definiti con =interi unici= contenuti in nomi simbolici
- in <signal.h> o <sys/signal.h>
- della forma SIGxxxx
  + utilizzabili piú facilmente in quanto le implementazioni variano nei numeri assegnati ad ogni segnale

#+name: Listing signals using strsignal(int signum)
#+begin_src C
for (i=0; i<NSIG; i++) {
    printf("Signal #%2d: %s\n", i, strsignal(i));
}
#+end_src

*** Lifecycle
:PROPERTIES:
:NOTER_PAGE: 10
:END:

Un segnale:
- _generato_ da qualche evento
- _delivered_ ad un processo
  + questo esegue qualche azione in risposta al segnale
Nel periodo di tempo intercorrente tra la generazione e l'invio al processo il segnale é _pending_
- viene inviato
  - appena il processo é scelto per l'esecuzione
  - immediatamente se il processo é in esecuzione
    + nel caso il processo invii un segnale a se stesso
_blocking_
A volte si deve assicurare che un blocco di codice non sia interrotto dalla consegna di un segnale
- aggiungere segnale alla _maschera dei segnali_
  + insieme dei segnali la cui risezione é attualmente bloccata
- il segnale rimane _pending_ fino a che non é sboccato e rimosso dalla maschera

_delivery & actions_
Di default
1. Il segnale é ignorato
2. Il processo é terminato _killed_
   + abnormal process termination
     - opposta alla exit()
3. Viene generato _core dump file_
   + virtual memory image
     - utilizzata per ispezionare lo stato del processo al momento della terminazione
4. Processo é bloccato _stopped_
5. Esecuzione riprende _resumed_

*** in Unix
:PROPERTIES:
:NOTER_PAGE: 15
:END:
**** trap
Segnali generati da eventi prodotti da un processo e inviati al processo stesso
- comportamenti errati possono generare trap
  + divisioni per zero _SIGFPE_
  + indirizzamento errato di array _SIGEGV_
  + negato l'accesso a instruzioni privilegiate _SIGILL_
**** interrupt
Segnali inviati ad un processo da un agente esterno (utente o altro processo)
- User
  + ^c _SIGINT_
  + ^z _SIGSTOP_
  + kill -s SIGNAL PID
- Altro processo
  + kill(PID,SIGNAL)
**** disposition
Impostazione della disposizione del segnale: sovrascrivere la disposizione (risposta) di default
- default
- ignore
- exec signal hadler
  + funzione che esegue le azioni appropriate in riposta alla ricezione di un segnale
  + il segnale in questo caso é gestito _handled_ o intercettato _caught_

***** signal() & sigaction()
:PROPERTIES:
:NOTER_PAGE: 29
:END:



**** Segnali
:PROPERTIES:
:NOTER_PAGE: 20
:END:

***** SIGABRT
***** SIGALRM
***** SIGCHLD
***** SIGCONT
***** SIGINT
Il terminale invia questo segnale al gruppo del processo in foreground
***** SIGKILL
Non puó essere bloccato, ignorato, intercettato da un  hander
- termina sempre un processo
***** SIGPIPE
Inviato quando un processo tempa di scrivere su un pipe o FIFO il quale non ha un corrispondente lettore
***** SIGSEGV
O Segmentation Violation
Processo tenta un riferimento in memoria non valido
- la pagina non esiste
- tentata modifica a locazione read-only
- tentato accesso alla memoria del kernel
Spesso a causa di un puntatore che contiene un _bad address_

** Facilities


*** System V IPC
**** syscall
- msgget()
- semget()
- shmget()

**** message queues
I messaggi possono essere pescati per tipo oltre che ordine
**** shared memory
Uno degli strumenti di IPC piú veloci

**** semaphores
set di semafori
*** Sincronizzazione
:PROPERTIES:
:NOTER_DOCUMENT: ../../../Documents/UNI/II/SO/05_pipes_FIFOs_1X.pdf
:NOTER_PAGE: 23
:END:

**** Semafori
:PROPERTIES:
:NOTER_PAGE: 17
:END:
- blocking
- non-blocking
Aumento del semaforo    :: reso disponibile
Decremento del semaforo :: accesso all'area critica
***** Syscall
#+begin_src C
#include <sys/types.h>
#include <sys/sem.h>
int semget(key_t key, int nsems, int semflg);
    // returns semaphore set identifier on success , -1 on error
    // semflg: IPC_CREAT, IPC_EXCL
int semclt(int semid, int semnum, int cmd, ... /* union semun arg */);
    // semun utilizzabile per l'argomento
    // IPC_RMID
    // IPC_STAT
    // IPC_SET
    // GETVAL
    // SETVAL
    // GETALL
    // SETALL
    // GETPID
    // GETNCNT
    // GETZCNT
int semop(int semid, struct sembuf *sops, unsigned int nsops);
    // sembuf codifies the operations to do
    // nops is the dimension of sops
struct semid_ds {
    struct ipc_perm sem_perm;
    time_t sem_otime; // timestamp of last semop (0 when created)
    time_t sem_ctime;
    unsigned short
}

struct sembuf {
    unsigned short sem_num;
    short sem_op;
    // group of operations are atomic and executed in their order
    // either they are all executed at once or not
    short sem_flg;
    // IPC_NOWAIT == non-blocking
}
#+end_src
Una semop bloccata fino a che:
- un processo sblocca il semaforo
- viene interrotto da un segnale di Interrupt
  + EINTR

***** binary semaphores
1: Free, 0: Reserved
- Reserve
- Wait
#+begin_src C
int initSem();
int reserveSem(int semID, int semNum);
int releaseSem(int semId, int semNum);
#+end_src

*** Communication Facilities
:PROPERTIES:
:NOTER_PAGE: 57
:NOTER_DOCUMENT: ../../../Documents/UNI/II/SO/05_pipes_FIFOs_1X.pdf
:END:

**** Distruttivitá
:PROPERTIES:
:NOTER_PAGE: 13
:END:
I dati sono consumati con la lettura

**** Data transfer

***** byte stream
Si scrivono/leggono numeri arbitrari di byte

****** Pipes
:PROPERTIES:
:NOTER_PAGE: 19
:END:
Permettono l'utilizzo dell'output di un processo come input di un altro processo
Il suo funzionamento é implementato utilizzando
- fork()
- exec()

Il pipe ha un _verso_
- write end
- read end

I processi semplicemente scrivono su fd1 e leggono da fd0
- Essendo flussi non c'é la nozione di dimensione del messaggio
- La lettura é sequenziale secondo l'ordine di scrittura

Il pipe é semplicemente un =buffer=, ha una capacitá massima
- quando é pieno la scrittura viene bloccata finche non sará effettuata una lettura
- generalmente non é necessario conoscere la capacitá della pipe
- una dimensione maggiore porterá a meno context switch



******* Protocol
:PROPERTIES:
:NOTER_PAGE: 23
:END:
- carattere delimitatore
  + si sceglie un carattere che non sará utilizzato nei messaggi
- header / body
  + intestazione con lunghezza del messaggio seguente
- messaggi a dimensione fissa a $n$ byte

******* Syscal
:PROPERTIES:
:NOTER_PAGE: 27
:END:
#+begin_src C
int pipe(int filedes[2]);
// ritorna 0 on success, -1 on error
filedes[0]; // lettura
filedes[1]; // scrittura
#+end_src

******* Chiusura fd
:PROPERTIES:
:NOTER_PAGE: 32
:END:
Se il lettore non chiude il write-end alla chiusura dalla parte dello scrittore non verrá scritto EOF alla fine dello stream
Quando uno scrittore scrive su una pipe senza lettori questo riceve SIGPIPE
- che puó essere gestito
Un pipe chiamato prima di una fork puó mettere in comunicazione processi imparentati


****** FIFO
:PROPERTIES:
:NOTER_PAGE: 46
:END:
Sono dotati di un nome a differenza di un pipe
- possono essere utilizzati per comunicazione tra processi non imparentati
  + architettura client-server

Come pipe
- write-end read-end

******* Syscall
:PROPERTIES:
:NOTER_PAGE: 49
:END:
#+begin_src C
int mkfifo(const char *pathname, mode_t mode);
// returns  on success, -1 on error
#+end_src

******* Sincronizzazione
:PROPERTIES:
:NOTER_PAGE: 50
:END:
Possibile creare una fork nella pipeline utilizzando il comando =tee=
- duplicato dell'outut viene inviato ad un terzo processo _oltre_ che il suo successore nella pipeline



