content/posts/20200929150510-unix.md


#### Symbolic Names and Numbers {#symbolic-names-and-numbers}

Segnali definiti con `interi unici` contenuti in nomi simbolici

-   in &lt;signal.h&gt; o &lt;sys/signal.h&gt;
-   della forma SIGxxxx
    -   utilizzabili piú facilmente in quanto le implementazioni variano nei numeri assegnati ad ogni segnale

<!--listend-->

<a id="code-snippet--Listing signals using strsignal(int signum)"></a>
```C
for (i=0; i<NSIG; i++) {
    printf("Signal #%2d: %s\n", i, strsignal(i));
}
```


#### Lifecycle {#lifecycle}

Un segnale:

-   <span class="underline">generato</span> da qualche evento
-   <span class="underline">delivered</span> ad un processo
    -   questo esegue qualche azione in risposta al segnale

Nel periodo di tempo intercorrente tra la generazione e l'invio al processo il segnale é <span class="underline">pending</span>

-   viene inviato
    -   appena il processo é scelto per l'esecuzione
    -   immediatamente se il processo é in esecuzione
        -   nel caso il processo invii un segnale a se stesso

<span class="underline">blocking</span>
A volte si deve assicurare che un blocco di codice non sia interrotto dalla consegna di un segnale

-   aggiungere segnale alla <span class="underline">maschera dei segnali</span>
    -   insieme dei segnali la cui risezione é attualmente bloccata
-   il segnale rimane <span class="underline">pending</span> fino a che non é sboccato e rimosso dalla maschera

<span class="underline">delivery &amp; actions</span>
Di default

1.  Il segnale é ignorato
2.  Il processo é terminato <span class="underline">killed</span>
    -   abnormal process termination
        -   opposta alla exit()
3.  Viene generato <span class="underline">core dump file</span>
    -   virtual memory image
        -   utilizzata per ispezionare lo stato del processo al momento della terminazione
4.  Processo é bloccato <span class="underline">stopped</span>
5.  Esecuzione riprende <span class="underline">resumed</span>


#### in Unix {#in-unix}


##### trap {#trap}

Segnali generati da eventi prodotti da un processo e inviati al processo stesso

-   comportamenti errati possono generare trap
    -   divisioni per zero <span class="underline">SIGFPE</span>
    -   indirizzamento errato di array <span class="underline">SIGEGV</span>
    -   negato l'accesso a instruzioni privilegiate <span class="underline">SIGILL</span>


##### interrupt {#interrupt}

Segnali inviati ad un processo da un agente esterno (utente o altro processo)

-   User
    -   ^c <span class="underline">SIGINT</span>
    -   ^z <span class="underline">SIGSTOP</span>
    -   kill -s SIGNAL PID
-   Altro processo
    -   kill(PID,SIGNAL)


##### disposition {#disposition}

Impostazione della disposizione del segnale: sovrascrivere la disposizione (risposta) di default

-   default
-   ignore
-   exec signal hadler
    -   funzione che esegue le azioni appropriate in riposta alla ricezione di un segnale
    -   il segnale in questo caso é gestito <span class="underline">handled</span> o intercettato <span class="underline">caught</span>


###### signal() &amp; sigaction() {#signal-and-sigaction}


##### Segnali {#segnali}


###### SIGABRT {#sigabrt}


###### SIGALRM {#sigalrm}


###### SIGCHLD {#sigchld}


###### SIGCONT {#sigcont}


###### SIGINT {#sigint}

Il terminale invia questo segnale al gruppo del processo in foreground


###### SIGKILL {#sigkill}

Non puó essere bloccato, ignorato, intercettato da un  hander

-   termina sempre un processo


###### SIGPIPE {#sigpipe}

Inviato quando un processo tempa di scrivere su un pipe o FIFO il quale non ha un corrispondente lettore


###### SIGSEGV {#sigsegv}

O Segmentation Violation
Processo tenta un riferimento in memoria non valido

-   la pagina non esiste
-   tentata modifica a locazione read-only
-   tentato accesso alla memoria del kernel

Spesso a causa di un puntatore che contiene un <span class="underline">bad address</span>


### Facilities {#facilities}


#### System V IPC {#system-v-ipc}


##### syscall {#syscall}

-   msgget()
-   semget()
-   shmget()


##### message queues {#message-queues}

I messaggi possono essere pescati per tipo oltre che ordine


##### shared memory {#shared-memory}

Uno degli strumenti di IPC piú veloci


##### semaphores {#semaphores}

set di semafori


#### Sincronizzazione {#sincronizzazione}


##### Semafori {#semafori}

-   blocking
-   non-blocking

Aumento del semaforo    :: reso disponibile
Decremento del semaforo :: accesso all'area critica


###### Syscall {#syscall}

```C
#include <sys/types.h>
#include <sys/sem.h>
int semget(key_t key, int nsems, int semflg);
    // returns semaphore set identifier on success , -1 on error
    // semflg: IPC_CREAT, IPC_EXCL
int semclt(int semid, int semnum, int cmd, ... /* union semun arg */);
    // semun utilizzabile per l'argomento
    // IPC_RMID
    // IPC_STAT
    // IPC_SET
    // GETVAL
    // SETVAL
    // GETALL
    // SETALL
    // GETPID
    // GETNCNT
    // GETZCNT
int semop(int semid, struct sembuf *sops, unsigned int nsops);
    // sembuf codifies the operations to do
    // nops is the dimension of sops
struct semid_ds {
    struct ipc_perm sem_perm;
    time_t sem_otime; // timestamp of last semop (0 when created)
    time_t sem_ctime;
    unsigned short
}

struct sembuf {
    unsigned short sem_num;
    short sem_op;
    // group of operations are atomic and executed in their order
    // either they are all executed at once or not
    short sem_flg;
    // IPC_NOWAIT == non-blocking
}
```

Una semop bloccata fino a che:

-   un processo sblocca il semaforo
-   viene interrotto da un segnale di Interrupt
    -   EINTR


###### binary semaphores {#binary-semaphores}

1: Free, 0: Reserved

-   Reserve
-   Wait

<!--listend-->

```C
int initSem();
int reserveSem(int semID, int semNum);
int releaseSem(int semId, int semNum);
```


#### Communication Facilities {#communication-facilities}


##### Distruttivitá {#distruttivitá}

I dati sono consumati con la lettura


##### Data transfer {#data-transfer}


###### byte stream {#byte-stream}

Si scrivono/leggono numeri arbitrari di byte

<!--list-separator-->

-  Pipes

    Permettono l'utilizzo dell'output di un processo come input di un altro processo
    Il suo funzionamento é implementato utilizzando

    -   fork()
    -   exec()

    Il pipe ha un <span class="underline">verso</span>

    -   write end
    -   read end

    I processi semplicemente scrivono su fd1 e leggono da fd0

    -   Essendo flussi non c'é la nozione di dimensione del messaggio
    -   La lettura é sequenziale secondo l'ordine di scrittura

    Il pipe é semplicemente un `buffer`, ha una capacitá massima

    -   quando é pieno la scrittura viene bloccata finche non sará effettuata una lettura
    -   generalmente non é necessario conoscere la capacitá della pipe
    -   una dimensione maggiore porterá a meno context switch

    <!--list-separator-->

    -  Protocol

        -   carattere delimitatore
            -   si sceglie un carattere che non sará utilizzato nei messaggi
        -   header / body
            -   intestazione con lunghezza del messaggio seguente
        -   messaggi a dimensione fissa a \\(n\\) byte

    <!--list-separator-->

    -  Syscal

        ```C
        int pipe(int filedes[2]);
        // ritorna 0 on success, -1 on error
        filedes[0]; // lettura
        filedes[1]; // scrittura
        ```

    <!--list-separator-->

    -  Chiusura fd

        Se il lettore non chiude il write-end alla chiusura dalla parte dello scrittore non verrá scritto EOF alla fine dello stream
        Quando uno scrittore scrive su una pipe senza lettori questo riceve SIGPIPE

        -   che puó essere gestito

        Un pipe chiamato prima di una fork puó mettere in comunicazione processi imparentati

<!--list-separator-->

-  FIFO

    Sono dotati di un nome a differenza di un pipe

    -   possono essere utilizzati per comunicazione tra processi non imparentati
        -   architettura client-server

    Come pipe

    -   write-end read-end

    <!--list-separator-->

    -  Syscall

        ```C
        int mkfifo(const char *pathname, mode_t mode);
        // returns  on success, -1 on error
        ```

    <!--list-separator-->

    -  Sincronizzazione

        Possibile creare una fork nella pipeline utilizzando il comando `tee`

        -   duplicato dell'outut viene inviato ad un terzo processo <span class="underline">oltre</span> che il suo successore nella pipeline
